NordicPlayground/nrf52-ble-multi-link-multi-role/libraries_util_sdk_clone/app_util.h
/**
 * @brief Mapping N arguments macro with current index
 *
 * Macro is similar to @ref MACRO_MAP_FOR but maps exact number of arguments.
 * If there is more arguments given, the rest would be ignored.
 *
 * @param N   Number of arguments to map
 * @param ... Macro name to be used for argument processing followed by arguments to process.
 *            Macro should have following form: MACRO(argument, index)
 *
 * @return Selected number of arguments processed by given macro
 */
#define MACRO_MAP_FOR_N(N, ...) MACRO_MAP_FOR_N_(N, __VA_ARGS__)
#define MACRO_MAP_FOR_N_(N, ...) CONCAT_2(MACRO_MAP_FOR_, N)((MACRO_MAP_FOR_N_LIST), __VA_ARGS__, )

#define MACRO_MAP_FOR_0( n_list, ...)

#define MACRO_MAP_FOR_1( n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))

#define MACRO_MAP_FOR_2( n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_1 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_3( n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_2 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_4( n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_3 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_5( n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_4 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_6( n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_5 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_7( n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_6 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_8( n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_7 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_9( n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_8 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_10(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_9 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_11(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_10((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_12(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_11((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_13(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_12((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_14(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_13((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_15(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_14((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_16(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_15((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_17(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_16((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_18(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_17((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_19(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_18((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_20(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_19((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
