NordicPlayground/nrf52-ble-multi-link-multi-role/libraries_util_sdk_clone/app_util.h
#define MACRO_MAP_FOR_21(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_20((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_22(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_21((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_23(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_22((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_24(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_23((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_25(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_24((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_26(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_25((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_27(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_26((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_28(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_27((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_29(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_28((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_30(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_29((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_31(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_30((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_32(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_31((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_33(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_32((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_34(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_33((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_35(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_34((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_36(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_35((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_37(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_36((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_38(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_37((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_39(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_38((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_40(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_39((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_41(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_40((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_42(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_41((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
