NordicPlayground/nrf52-ble-multi-link-multi-role/libraries_util_sdk_clone/app_util.h
#define MACRO_MAP_FOR_43(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_42((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_44(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_43((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_45(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_44((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_46(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_45((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_47(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_46((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_48(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_47((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_49(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_48((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_50(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_49((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_51(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_50((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_52(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_51((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_53(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_52((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_54(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_53((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_55(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_54((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_56(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_55((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_57(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_56((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_58(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_57((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_59(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_58((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_60(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_59((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_61(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_60((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_62(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_61((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_63(n_list, macro, a, ...)                                         \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)))                                     \
    MACRO_MAP_FOR_62((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__, )

/**
 * @brief Mapping macro with current index and parameter
 *
 * Version of @ref MACRO_MAP_FOR that passes also the same parameter to all macros.
 *
 * @param param Parameter that would be passed to each macro call during mapping.
 * @param ...   Macro name to be used for argument processing followed by arguments to process.
 *              Macro should have following form: MACRO(argument, index, param)
 *
 * @return All arguments processed by given macro
 */
#define MACRO_MAP_FOR_PARAM(param, ...) MACRO_MAP_FOR_PARAM_(param, __VA_ARGS__)
#define MACRO_MAP_FOR_PARAM_(param, ...) MACRO_MAP_FOR_PARAM_N(NUM_VA_ARGS_LESS_1(__VA_ARGS__), param, __VA_ARGS__)

/**
 * @brief Mapping N arguments macro with with current index and parameter
 *
 * @param N     Number of arguments to map
 * @param param Parameter that would be passed to each macro call during mapping.
 * @param ...   Macro name to be used for argument processing followed by arguments to process.
 *              Macro should have following form: MACRO(argument, index, param)
 *
 * @return All arguments processed by given macro
 */
#define MACRO_MAP_FOR_PARAM_N(N, param, ...) MACRO_MAP_FOR_PARAM_N_(N, param, __VA_ARGS__)
#define MACRO_MAP_FOR_PARAM_N_(N, param, ...) CONCAT_2(MACRO_MAP_FOR_PARAM_, N)((MACRO_MAP_FOR_N_LIST), param, __VA_ARGS__, )


#define MACRO_MAP_FOR_PARAM_0( n_list, param, ...)

