NordicPlayground/nrf52-ble-multi-link-multi-role/libraries_util_sdk_clone/app_util.h
#define MACRO_MAP_FOR_PARAM_1( n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)

#define MACRO_MAP_FOR_PARAM_2( n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_1 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_PARAM_3( n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_2 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_4( n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_3 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_5( n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_4 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_6( n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_5 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_7( n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_6 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_8( n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_7 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_9( n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_8 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_10(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_9 ((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_11(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_10((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_12(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_11((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_13(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_12((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_14(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_13((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_15(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_14((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_PARAM_16(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_15((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_PARAM_17(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_16((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_PARAM_18(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_17((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_PARAM_19(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_18((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_PARAM_20(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_19((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )    

#define MACRO_MAP_FOR_PARAM_21(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_20((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )    
    
#define MACRO_MAP_FOR_PARAM_22(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_21((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )    

#define MACRO_MAP_FOR_PARAM_23(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_22((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )    

#define MACRO_MAP_FOR_PARAM_24(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_23((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )    

#define MACRO_MAP_FOR_PARAM_25(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_24((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )    

#define MACRO_MAP_FOR_PARAM_26(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_25((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )    

