NordicPlayground/nrf52-ble-multi-link-multi-role/libraries_util_sdk_clone/app_util.h
#define MACRO_MAP_FOR_PARAM_27(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_26((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )    

#define MACRO_MAP_FOR_PARAM_28(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_27((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )    

#define MACRO_MAP_FOR_PARAM_29(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_28((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )        

#define MACRO_MAP_FOR_PARAM_30(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_29((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )        

#define MACRO_MAP_FOR_PARAM_31(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_30((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )        

#define MACRO_MAP_FOR_PARAM_32(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_31((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )        
    
#define MACRO_MAP_FOR_PARAM_33(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_32((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )        
    
#define MACRO_MAP_FOR_PARAM_34(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_33((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )        
    
#define MACRO_MAP_FOR_PARAM_35(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_34((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )        
    
#define MACRO_MAP_FOR_PARAM_36(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_35((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )        
    
#define MACRO_MAP_FOR_PARAM_37(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_36((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )        
    
#define MACRO_MAP_FOR_PARAM_38(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_37((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_PARAM_39(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_38((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_40(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_39((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_41(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_40((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_PARAM_42(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_41((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_43(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_42((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_44(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_43((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_45(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_44((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_46(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_45((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_47(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_46((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_48(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_47((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_49(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_48((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_50(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_49((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_51(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_50((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
