NordicPlayground/nrf52-ble-multi-link-multi-role/libraries_util_sdk_clone/app_util.h
#define MACRO_MAP_FOR_PARAM_52(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_51((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_53(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_52((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_54(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_53((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_55(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_54((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_56(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_55((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_57(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_56((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_58(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_57((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_59(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_58((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_60(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_59((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_61(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_60((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )

#define MACRO_MAP_FOR_PARAM_62(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_61((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
#define MACRO_MAP_FOR_PARAM_63(n_list, param, macro, a, ...)                                            \
    macro(a, GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), param)                                              \
    MACRO_MAP_FOR_PARAM_62((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), param, macro, __VA_ARGS__, )
    
/**
 * @brief Repeating macro.
 *
 * @param count Count of repeats.
 * @param macro Macro must have the following form: MACRO(arguments).
 * @param ...   Arguments passed to the macro.
 *
 * @return All arguments processed by the given macro.
 */
#define MACRO_REPEAT(count, macro, ...)     MACRO_REPEAT_(count, macro, __VA_ARGS__)
#define MACRO_REPEAT_(count, macro, ...)    CONCAT_2(MACRO_REPEAT_, count)(macro, __VA_ARGS__)

#define MACRO_REPEAT_0(macro, ...)
#define MACRO_REPEAT_1(macro, ...)  macro(__VA_ARGS__) MACRO_REPEAT_0(macro, __VA_ARGS__)
#define MACRO_REPEAT_2(macro, ...)  macro(__VA_ARGS__) MACRO_REPEAT_1(macro, __VA_ARGS__)
#define MACRO_REPEAT_3(macro, ...)  macro(__VA_ARGS__) MACRO_REPEAT_2(macro, __VA_ARGS__)
#define MACRO_REPEAT_4(macro, ...)  macro(__VA_ARGS__) MACRO_REPEAT_3(macro, __VA_ARGS__)
#define MACRO_REPEAT_5(macro, ...)  macro(__VA_ARGS__) MACRO_REPEAT_4(macro, __VA_ARGS__)
#define MACRO_REPEAT_6(macro, ...)  macro(__VA_ARGS__) MACRO_REPEAT_5(macro, __VA_ARGS__)
#define MACRO_REPEAT_7(macro, ...)  macro(__VA_ARGS__) MACRO_REPEAT_6(macro, __VA_ARGS__)
#define MACRO_REPEAT_8(macro, ...)  macro(__VA_ARGS__) MACRO_REPEAT_7(macro, __VA_ARGS__)
#define MACRO_REPEAT_9(macro, ...)  macro(__VA_ARGS__) MACRO_REPEAT_8(macro, __VA_ARGS__)
#define MACRO_REPEAT_10(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_9(macro, __VA_ARGS__)
#define MACRO_REPEAT_11(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_10(macro, __VA_ARGS__)
#define MACRO_REPEAT_12(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_11(macro, __VA_ARGS__)
#define MACRO_REPEAT_13(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_12(macro, __VA_ARGS__)
#define MACRO_REPEAT_14(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_13(macro, __VA_ARGS__)
#define MACRO_REPEAT_15(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_14(macro, __VA_ARGS__)
#define MACRO_REPEAT_16(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_15(macro, __VA_ARGS__)
#define MACRO_REPEAT_17(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_16(macro, __VA_ARGS__)
#define MACRO_REPEAT_18(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_17(macro, __VA_ARGS__)
#define MACRO_REPEAT_19(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_18(macro, __VA_ARGS__)
#define MACRO_REPEAT_20(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_19(macro, __VA_ARGS__)
#define MACRO_REPEAT_21(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_20(macro, __VA_ARGS__)
#define MACRO_REPEAT_22(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_21(macro, __VA_ARGS__)
#define MACRO_REPEAT_23(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_22(macro, __VA_ARGS__)
#define MACRO_REPEAT_24(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_23(macro, __VA_ARGS__)
#define MACRO_REPEAT_25(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_24(macro, __VA_ARGS__)
#define MACRO_REPEAT_26(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_25(macro, __VA_ARGS__)
#define MACRO_REPEAT_27(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_26(macro, __VA_ARGS__)
#define MACRO_REPEAT_28(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_27(macro, __VA_ARGS__)
#define MACRO_REPEAT_29(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_28(macro, __VA_ARGS__)
#define MACRO_REPEAT_30(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_29(macro, __VA_ARGS__)
#define MACRO_REPEAT_31(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_30(macro, __VA_ARGS__)
#define MACRO_REPEAT_32(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_31(macro, __VA_ARGS__)
#define MACRO_REPEAT_33(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_32(macro, __VA_ARGS__)
#define MACRO_REPEAT_34(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_33(macro, __VA_ARGS__)
#define MACRO_REPEAT_35(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_34(macro, __VA_ARGS__)
#define MACRO_REPEAT_36(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_35(macro, __VA_ARGS__)
#define MACRO_REPEAT_37(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_36(macro, __VA_ARGS__)
#define MACRO_REPEAT_38(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_37(macro, __VA_ARGS__)
#define MACRO_REPEAT_39(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_38(macro, __VA_ARGS__)
#define MACRO_REPEAT_40(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_39(macro, __VA_ARGS__)
#define MACRO_REPEAT_41(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_40(macro, __VA_ARGS__)
#define MACRO_REPEAT_42(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_41(macro, __VA_ARGS__)
#define MACRO_REPEAT_43(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_42(macro, __VA_ARGS__)
#define MACRO_REPEAT_44(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_43(macro, __VA_ARGS__)
#define MACRO_REPEAT_45(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_44(macro, __VA_ARGS__)
#define MACRO_REPEAT_46(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_45(macro, __VA_ARGS__)
#define MACRO_REPEAT_47(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_46(macro, __VA_ARGS__)
#define MACRO_REPEAT_48(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_47(macro, __VA_ARGS__)
#define MACRO_REPEAT_49(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_48(macro, __VA_ARGS__)
#define MACRO_REPEAT_50(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_49(macro, __VA_ARGS__)
#define MACRO_REPEAT_51(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_50(macro, __VA_ARGS__)
#define MACRO_REPEAT_52(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_51(macro, __VA_ARGS__)
#define MACRO_REPEAT_53(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_52(macro, __VA_ARGS__)
#define MACRO_REPEAT_54(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_53(macro, __VA_ARGS__)
#define MACRO_REPEAT_55(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_54(macro, __VA_ARGS__)
#define MACRO_REPEAT_56(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_55(macro, __VA_ARGS__)
#define MACRO_REPEAT_57(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_56(macro, __VA_ARGS__)
#define MACRO_REPEAT_58(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_57(macro, __VA_ARGS__)
#define MACRO_REPEAT_59(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_58(macro, __VA_ARGS__)
#define MACRO_REPEAT_60(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_59(macro, __VA_ARGS__)
#define MACRO_REPEAT_61(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_60(macro, __VA_ARGS__)
#define MACRO_REPEAT_62(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_61(macro, __VA_ARGS__)
#define MACRO_REPEAT_63(macro, ...) macro(__VA_ARGS__) MACRO_REPEAT_62(macro, __VA_ARGS__)


/**
 * @brief Repeating macro with current index.
 *
 * Macro similar to @ref MACRO_REPEAT but the processing function gets the arguments
 * and the current argument index (beginning from 0).

 * @param count Count of repeats.
 * @param macro Macro must have the following form: MACRO(index, arguments).
 * @param ...   Arguments passed to the macro.
 *
 * @return All arguments processed by the given macro.
 */
#define MACRO_REPEAT_FOR(count, macro, ...)     \
    MACRO_REPEAT_FOR_(count, macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_(count, macro, ...)    \
    CONCAT_2(MACRO_REPEAT_FOR_, count)((MACRO_MAP_FOR_N_LIST), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_0(n_list, macro, ...)

#define MACRO_REPEAT_FOR_1(n_list, macro, ...)                                              \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_0((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

