NordicPlayground/nrf52-ble-multi-link-multi-role/libraries_util_sdk_clone/app_util.h
#define MACRO_REPEAT_FOR_2(n_list, macro, ...)                                              \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_1((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_3(n_list, macro, ...)                                              \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_2((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)     

#define MACRO_REPEAT_FOR_4(n_list, macro, ...)                                              \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_3((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_5(n_list, macro, ...)                                              \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_4((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_6(n_list, macro, ...)                                              \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_5((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_7(n_list, macro, ...)                                              \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_6((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_8(n_list, macro, ...)                                              \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_7((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_9(n_list, macro, ...)                                              \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_8((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_10(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_9((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_11(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_10((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_12(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_11((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_13(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_12((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_14(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_13((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_15(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_14((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_16(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_15((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_17(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_16((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_18(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_17((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_19(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_18((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)    
    
#define MACRO_REPEAT_FOR_20(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_19((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_21(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_20((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_22(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_21((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_23(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_22((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_24(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_23((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_25(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_24((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
