NordicPlayground/nrf52-ble-multi-link-multi-role/libraries_util_sdk_clone/app_util.h
#define MACRO_REPEAT_FOR_26(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_25((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_27(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_26((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_28(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_27((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_29(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_28((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_30(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_29((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_31(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_30((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_32(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_31((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_33(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_32((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_34(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_33((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_35(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_34((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_36(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_35((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_37(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_36((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_38(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_37((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_39(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_38((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_40(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_39((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_41(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_40((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_42(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_41((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_43(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_42((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_44(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_43((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_45(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_44((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_46(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_45((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_47(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_46((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_48(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_47((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_49(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_48((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
#define MACRO_REPEAT_FOR_50(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_49((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)

#define MACRO_REPEAT_FOR_51(n_list, macro, ...)                                             \
    macro(GET_VA_ARG_1(BRACKET_EXTRACT(n_list)), __VA_ARGS__)                               \
    MACRO_REPEAT_FOR_50((GET_ARGS_AFTER_1(BRACKET_EXTRACT(n_list))), macro, __VA_ARGS__)
    
